import { Metadata } from "next"

const timeLine = [
    {
        year: '2518',
        content: 'มหาวิทยาลัยเกษตรศาสตร์ ได้มีคำสั่งที่ 1220/ 2518 ลงวันที่ 23 ธันวาคม 2518 แต่งตั้งคณะทำงานเพื่อเตรียม จัดตั้ง<b>ศูนย์คอมพิวเตอร์ มหาวิทยาลัยเกษตรศาสตร์</b> (ประกอบด้วย นายธีระ สูตะบุตร นายนนทวัฒน์ จันทร์เจริญ และนายยรรยง บุญ-หลง) คณะทำงานชุดดังกล่าวได้ดำเนินการเตรียมจัดตั้งศูนย์คอมพิวเตอร์ มหาวิทยาลัยเกษตรศาสตร์ ไว้เป็นส่วนหนึ่งของ สถาบันวิจัยและพัฒนาแห่งมหาวิทยาลัยเกษตรศาสตร์ เพื่อให้บริการด้านคอมพิวเตอร์แก่ นิสิต อาจารย์ ข้าราชการ และหน่วยงานของมหาวิทยาลัยเกษตรศาสตร์ ขณะนั้นได้รับการสนับสนุนอุปกรณ์เครื่องจักรประเมินผลจากโครงการเงินกู้ธนาคารโลกเพื่อพัฒนามหาวิทยาลัยเกษตรศาสตร์'
    },
    {
        year: '2523',
        content: 'สถาบันวิจัยและพัฒนาฯ ได้ปรับโครงสร้างการบริหารงานภายในใหม่ โดยจัดให้ศูนย์คอมพิวเตอร์ มหาวิทยาลัยเกษตรศาสตร์ ซึ่งเดิมเป็นหน่วยงานสังกัดโดยตรงต่อสถาบันวิจัยและพัฒนาฯ ลดฐานะลงมาเป็นหน่วยงานระดับหน่วย สังกัดฝ่ายบริการงานวิจัย โดยงบประมาณและอัตรากำลังยังใช้ของสถาบันวิจัยและพัฒนาฯ จนกระทั่งปีงบประมาณ 2526 ( 1 ตุลาคม 2525) ได้ตั้งงบประมาณไว้ในแผนงานบริหารทั่วไป (บางเขน) แม้จะได้งบประมาณมากขึ้นแต่ทำให้เกิดปัญหาอุปสรรค โดยเฉพาะด้านบุคลากรเพราะเงินเดือนจะต้องเบิกจ่ายจากหน่วยงานเจ้าสังกัดตามที่ระบุไว้ใน กม. อีกทั้งการขออัตรากำลังใหม่ไม่สามารถทำได้เนื่องจากเป็นหน่วยงานที่ไม่มีกฎหมายรองรับ'
    },
    {
        year: '2525',
        content: 'ที่ประชุมคณบดี ในคราวประชุมครั้งที่ 18/2525 เมื่อวันที่ 18 ตุลาคม 2525 ได้มีมติเห็นชอบในหลักการให้แยกงานคอมพิวเตอร์ออกมาจากสถาบันวิจัยและพัฒนาแห่งมหาวิทยาลัยเกษตรศาสตร์ และจัดตั้งเป็น<b>ศูนย์บริการคอมพิวเตอร์ มีฐานะเทียบเท่ากอง สังกัดสำนักงานอธิการบดี</b>'
    },
    {
        year: '2526',
        content: 'มหาวิทยาลัยได้ตระหนักถึงความสำคัญด้านเทคโนโลยีสารสนเทศที่มีต่อการพัฒนามหาวิทยาลัยให้ก้าวเข้าสู่ความเป็นสากลในอนาคต จึงได้เสนอโครงการจัดตั้งสำนักบริการคอมพิวเตอร์ต่อที่ประชุมสภามหาวิทยาลัยเกษตรศาสตร์ ในคราวประชุมครั้งที่ 6/2526 เมื่อวันที่ 12ธันวาคม 2526 ที่ประชุมมีมติเห็นชอบในการจัดตั้ง <b>“สำนักบริการคอมพิวเตอร์”</b> โดยในระยะแรกให้เป็นโครงการภายใต้การดูแลของสำนักงานอธิการบดี และเตรียมยกฐานะเป็นหน่วยงานเทียบเท่าระดับคณะ'
    },
    {
        year: '2528',
        content: 'จึงได้<b>ยกฐานะสำนักบริการคอมพิวเตอร์เป็นหน่วยงานเทียบเท่าระดับคณะในวันที่ 25 มกราคม 2528</b> ตามประกาศในราชกิจจานุเบกษา (ฉบับพิเศษ เล่ม 102 ตอนที่ 13 ฉบับวันที่ 1 กุมภาพันธ์ 2528) ปี พ.ศ. 2532 กม. มีมติอนุมัติให้แบ่งส่วนราชการภายในสำนักบริการคอมพิวเตอร์ออกเป็น 4 ฝ่าย (หนังสือที่ ทม 0202/25476 ลงวันที่ 22 กันยายน 2532) ได้แก่ ฝ่ายบริหารและธุรการทั่วไป ฝ่ายวิชาการ ฝ่ายปฏิบัติการ ฝ่ายระบบและพัฒนาโปรแกรม สำนักบริการคอมพิวเตอร์ได้มีการประชุมทบทวนปรับโครงสร้างในการบริหารงาน เพื่อให้เกิดความเหมาะสมอยู่เสมอ ปัจจุบันโครงสร้างแบ่งส่วนราชการของสำนักฯ ใหม่ ตามคำสั่งสำนักบริการคอมพิวเตอร์ที่ 014/2558 เมื่อวันที่ 27 มกราคม 2558 โดยแบ่งโครงสร้างการบริหารงานออกเป็น 5 ฝ่าย ได้แก่ <ul><li>1. สำนักงานเลขานุการ</li><li>2. ฝ่ายฝึกอบรมและสื่ออิเล็กทรอนิกส์</li><li>3. ฝ่ายระบบสารสนเทศ</li><li>4. ฝ่ายระบบคอมพิวเตอร์และเครือข่าย</li><li>5. ฝ่ายบริการสารสนเทศ</li>'
    },
]

export const metadata: Metadata = {
    title: "เกี่ยวกับเรา | EDUCERT",
    description: "EDUCERT หรือ Education Computer Emergency Response Team เป็นหน่วยงานที่เกี่ยวข้องกับการรับมือการโจมตีทางไซเบอร์ และการป้องกันการโจมตีทางไซเบอร์ โดยมีหน้าที่หลักในการป้องกันและแก้ไขปัญหาด้านความปลอดภัยของระบบสารสนเทศและการสื่อสารของมหาวิทยาลัยเกษตรศาสตร์",
    openGraph: {
        title: "เกี่ยวกับเรา | EDUCERT",
        description: "EDUCERT หรือ Kasetsart University Computer Emergency Response Team เป็นหน่วยงานที่เกี่ยวข้องกับการรับมือการโจมตีทางไซเบอร์ และการป้องกันการโจมตีทางไซเบอร์ โดยมีหน้าที่หลักในการป้องกันและแก้ไขปัญหาด้านความปลอดภัยของระบบสารสนเทศและการสื่อสารของมหาวิทยาลัยเกษตรศาสตร์",
    }
}

export default function Page() {
    return (
        <div className="container px-2 max-w-5xl space-y-8">
            <p className="text-3xl font-bold">เกี่ยวกับเรา</p>
            <div className="flex justify-center w-full">
                <iframe className="md:w-[560px] md:h-[315px] w-full h-[315px]" src="https://www.youtube.com/embed/dObr503gpdI?si=NRcZ26qDIgflc5Vn" title="YouTube video player" allow="accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share" referrerPolicy="strict-origin-when-cross-origin" allowFullScreen></iframe>
            </div>
            {timeLine.map((item, index) => {
                return (
                    <div key={index} className="flex flex-col pt-3">
                        <span className="text-2xl">{item.year}</span>
                        <div dangerouslySetInnerHTML={{ __html: item.content }} />
                    </div>
                )
            })}
        </div>
    )
}